# openjdk
brew "openjdk"

# essentials
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "arc"
brew "awscli"
brew "ctags"
brew "curl"
cask "discord"
brew "duplicity"
cask "espanso"
brew "fish"
brew "fzf"
brew "git"
brew "golang"
brew "golangci-lint"
brew "mas"
brew "nmap"
brew "neovim"
brew "openssl"
cask "raycast"
brew "rbenv"
brew "ruby-build"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"

# mas
mas "Bear Markdown Notes", id: 1091189122
mas "Flow", id: 1423210932
mas "Moom", id: 419330170
mas "Pixelmator Pro", id: 1289583905
mas "Slack for Desktop", id: 803453959
mas "Tailscale", id: 1475387142

# fonts
cask "font-monaspace"
