# openjdk
brew "openjdk"

# essentials
cask "1password"
cask "1password-cli"
cask "alacritty"
brew "asciinema"
cask "claude-code"
cask "copilot-cli"
brew "ctags"
brew "curl"
cask "google-chrome@dev"
brew "fish"
brew "fzf"
brew "git"
brew "go"
brew "golangci-lint"
brew "lua"
brew "mas"
cask "moom"
brew "nmap"
brew "neovim"
brew "openssl"
cask "raycast"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "xsel"

# mas
mas "Bear Markdown Notes", id: 1091189122
mas "Flow", id: 1423210932

# personal packages (deployed to ~/Brewfile.personal by sync.sh)
require "~/Brewfile.personal" if File.exist? "~/Brewfile.personal"

